<a href="https://colab.research.google.com/github/tamkench95/Deep-river/blob/main/Untitled5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
pd1=pd.read.csv(/content/sample_data/california_housing_test.csv)

SyntaxError: ignored

In [57]:
pd2 = pd.read_excel('/content/sample_data/se.xlsx',header=None)

In [58]:
pd2

     0   1   2   3
0  이순신  85  87  90
1  강감찬  75  80  95
2  한석봉  99  98  99
3  황진이  35  45  20
4  안중근  90  85  90
5  박문수  95  98  96
6  임꺽정  15  35  45
7  김정호  90  95  80
8  정몽주  90  90  95
9  임수빈  50  45  60

In [59]:
p =pd2.copy()

In [60]:
p

     0   1   2   3
0  이순신  85  87  90
1  강감찬  75  80  95
2  한석봉  99  98  99
3  황진이  35  45  20
4  안중근  90  85  90
5  박문수  95  98  96
6  임꺽정  15  35  45
7  김정호  90  95  80
8  정몽주  90  90  95
9  임수빈  50  45  60

In [63]:
p.columns=['이름', '국어', '영어', '수학']

In [64]:
p

    이름  국어  영어  수학
0  이순신  85  87  90
1  강감찬  75  80  95
2  한석봉  99  98  99
3  황진이  35  45  20
4  안중근  90  85  90
5  박문수  95  98  96
6  임꺽정  15  35  45
7  김정호  90  95  80
8  정몽주  90  90  95
9  임수빈  50  45  60

In [65]:
p['이름']

0    이순신
1    강감찬
2    한석봉
3    황진이
4    안중근
5    박문수
6    임꺽정
7    김정호
8    정몽주
9    임수빈
Name: 이름, dtype: object

In [66]:
p.iloc[:,1:]>= 70

      국어     영어     수학
0   True   True   True
1   True   True   True
2   True   True   True
3  False  False  False
4   True   True   True
5   True   True   True
6  False  False  False
7   True   True   True
8   True   True   True
9  False  False  False

In [67]:
p.loc[:,['국어','영어','수학']] >= 70

      국어     영어     수학
0   True   True   True
1   True   True   True
2   True   True   True
3  False  False  False
4   True   True   True
5   True   True   True
6  False  False  False
7   True   True   True
8   True   True   True
9  False  False  False

In [82]:
p

    이름  국어  영어  수학
0  이순신  85  87  90
1  강감찬  75  80  95
2  한석봉  99  98  99
3  황진이  35  45  20
4  안중근  90  85  90
5  박문수  95  98  96
6  임꺽정  15  35  45
7  김정호  90  95  80
8  정몽주  90  90  95
9  임수빈  50  45  60

In [80]:
p.sum()

이름    이순신강감찬한석봉황진이안중근박문수임꺽정김정호정몽주임수빈
국어                               724
영어                               758
수학                               770
dtype: object

In [81]:
p.mean()

국어    72.4
영어    75.8
수학    77.0
dtype: float64

In [74]:
p.sum(axis=1)

0    262
1    250
2    296
3    100
4    265
5    289
6     95
7    265
8    275
9    155
dtype: int64

In [83]:
p['국어'].value_counts()

90    3
95    1
75    1
15    1
85    1
99    1
50    1
35    1
Name: 국어, dtype: int64

In [77]:
p['수학'].value_counts()

95    2
90    2
45    1
60    1
80    1
20    1
99    1
96    1
Name: 수학, dtype: int64

In [78]:
p['국어'].value_counts(ascending=False)

90    3
95    1
75    1
15    1
85    1
99    1
50    1
35    1
Name: 국어, dtype: int64

In [79]:
p['국어'].sort_values(ascending=False)

2    99
5    95
8    90
7    90
4    90
0    85
1    75
9    50
3    35
6    15
Name: 국어, dtype: int64

In [84]:
p.sort_values(by='영어')

    이름  국어  영어  수학
6  임꺽정  15  35  45
3  황진이  35  45  20
9  임수빈  50  45  60
1  강감찬  75  80  95
4  안중근  90  85  90
0  이순신  85  87  90
8  정몽주  90  90  95
7  김정호  90  95  80
2  한석봉  99  98  99
5  박문수  95  98  96

In [88]:
p.sort_values(by=['영어','수학','국어'], inplace=True)

In [91]:
def get_grade(x):
    grade =''
    if x>= 90: grade='수'
    elif x>= 80: grade= '우'
    elif x>= 70: grade= '미'
    elif x>= 60: grade= '양'
    else: grade = '가'
    return grade

In [92]:
p['평가'] = ㅔ['평균'].apply(lambda x: get_grade(x))

NameError: ignored